Repository: kandrakah/Kardinal.Net
Catalog: Web/Kardinal.Net.Web/Localization/Resource.*.resx
Languages: pt_br

# DEBUG_BACKGROUND_TASK_HOST_START
source: The background task host has been initialized.
pt_br: O host de tarefas em segundo plano foi inicializado.

# DEBUG_BACKGROUND_TASK_HOST_STOP
source: The background task host has terminated.
pt_br: O host de tarefas em segundo plano foi finalizado.

# ERROR_BACKGROUND_TASK_FAIL
source: Failed while executing background task {task}: {message}
pt_br: Falha durante a execução da tarefa em segundo plano {task}: {message}

# ERROR_BACKGROUND_TASK_NULL
source: The background task to be performed cannot be null.
pt_br: A tarefa em segundo plano à ser executada não pode ser nula.

# ERROR_CANT_USE_BOTH_KESTREL_IIS_INTEGRATION
source: It is not possible to use Kestrel and IIS integration simultaneously.
pt_br: Não é possível utilizar Kestrel e integração com o IIS simultaneamente.

# ERROR_CERTIFICATE_NOT_FOUND
source: The certificate entered was not found at [{path}].
pt_br: O certificado informado não foi localizado em [{path}].

# ERROR_CERTIFICATE_PRIVATE_KEY_MISSING
source: The certificate [{thumbprint}] does not have a private key assigned.
pt_br: O certificado [{thumbprint}] não possui uma chave privada atribuída.

# ERROR_CONTENT_ROOT_INVALID
source: Given content root [$[CONTENT_ROOT]] is not a valid directory!
pt_br: O diretório raíz {CONTENT_ROOT} é inválido!

# ERROR_NULL_EMPTY_CERTIFICATE_PATH
source: The service certificate location is null or invalid.
pt_br: A localização do certificado de serviço é nula ou inválida.

# ERROR_SERVICE_NOT_FOUND
source: The service $[SERVICE_NAME] was not found! Check that the service has been properly implemented and registered!
pt_br: O serviço $[SERVICE_NAME] não foi encontrado! Verifique se o serviço foi implementado e registrado corretamente!

# FINALIZING_SERVICE
source: The service is shutting down...
pt_br: O serviço está sendo encerrado...

# INITIALIZATION_APP_INFO
source: Initializing service {service} in environment {environment} [{processId}].
pt_br: Inicializando serviço {service} no ambiente {environment} [{processId}].

source: Initialization Complete
pt_br: Inicialização concluída!

# INITIALIZE_BASEPATH
source: Using base directory {BASEPATH}
pt_br: Usando diretório de base {PATH}

# INITIALIZE_IIS_INTEGRATION
source: Using IIS Integration
pt_br: Usando integração como o IIS

# LISTENING_URL
source: Listening to requests in {LISTENING_URL}
pt_br: Ouvindo requisições em {LISTENING_URL}

# SERVICE_FINALIZED
source: The service ended with the code {code}.
pt_br: O serviço foi encerrado com o código ${code}.

# STATUS_CODE_100
source: The request can be continued.
pt_br: A solicitação pode ser continuada.

# STATUS_CODE_101
source: Switching protocol.
pt_br: Protocolo de comutação.

# STATUS_CODE_200
source: The request has succeeded.
pt_br: A solicitação foi bem-sucedida.

# STATUS_CODE_201
source: The request has been fulfilled and resulted in a new resource being created.
pt_br: A solicitação foi atendida e resultou na criação de um novo recurso.

# STATUS_CODE_202
source: The request has been accepted for processing, but the processing has not been completed.
pt_br: A solicitação foi aceita para processamento, mas o processamento não foi concluído.

# STATUS_CODE_203
source: The returned metainformation in the entity-header is not the definitive set as available from the origin server, but is gathered from a local or a third-party copy.
pt_br: A meta informação retornada no cabeçalho da entidade não é o conjunto definitivo conforme disponível no servidor de origem, mas é coletada de uma cópia local ou de terceiros.

# STATUS_CODE_204
source: The server has fulfilled the request but does not need to return an entity-body, and might want to return updated metainformation.
pt_br: O servidor atendeu à solicitação, mas não precisa retornar um corpo de entidade e pode desejar retornar metainformações atualizadas.

# STATUS_CODE_205
source: The server has fulfilled the request and the user agent SHOULD reset the document view which caused the request to be sent.
pt_br: O servidor cumpriu o pedido e o agente de utilizador DEVE reiniciar a vista do documento que originou o envio do pedido.

# STATUS_CODE_206
source: The server has fulfilled the partial GET request for the resource.
pt_br: O servidor atendeu à solicitação parcial GET para o recurso.

# STATUS_CODE_300
source: Multiple responses available.
pt_br: Várias respostas disponíveis.

# STATUS_CODE_301
source: The requested resource has been moved to a new address.
pt_br: O recurso solicitado foi movido para um novo endereço.

# STATUS_CODE_302
source: The requested resource has been temporarily moved to another address.
pt_br: O recurso solicitado foi temporariamente movido para outro endereço.

# STATUS_CODE_400
source: The request was not accepted due to missing or not validated data. Check the content of the request.
pt_br: A solicitação não foi aceita devido a dados ausentes ou não validados. Verifique o conteúdo do pedido.

# STATUS_CODE_401
source: The request was not authorized. Check if the session is active, the access token has been informed or if the active user has authorization to access this service.
pt_br: O pedido não foi autorizado. Verifique se a sessão está ativa, se o token de acesso foi informado ou se o usuário ativo tem autorização para acessar este serviço.

# STATUS_CODE_403
source: Access to the requested service is not allowed.
pt_br: O acesso ao serviço solicitado não é permitido.

# STATUS_CODE_404
source: The requested service or resource was not found.
pt_br: O serviço ou recurso solicitado não foi encontrado.

# STATUS_CODE_405
source: The method specified in the request is not allowed for the requested resource.
pt_br: O método especificado na solicitação não é permitido para o recurso solicitado.

# STATUS_CODE_406
source: The resource identified by the request is only capable of generating response entities which have content characteristics not acceptable according to the accept headers sent in the request.
pt_br: O recurso identificado pela solicitação só é capaz de gerar entidades de resposta que possuem características de conteúdo não aceitáveis de acordo com os cabeçalhos de aceitação enviados na solicitação.

# STATUS_CODE_407
source: Proxy authentication is required before completing the request.
pt_br: A autenticação de proxy é necessária antes de concluir a solicitação.

# STATUS_CODE_408
source: The client did not produce a request within the time that the server was prepared to wait.
pt_br: O cliente não produziu um pedido dentro do tempo que o servidor estava preparado para esperar.

# STATUS_CODE_409
source: The request could not be completed due to a conflict with the current state of the resource.
pt_br: A solicitação não pôde ser concluída devido a um conflito com o estado atual do recurso.

# STATUS_CODE_410
source: The requested resource is no longer available at the server and no forwarding address is known.
pt_br: O recurso solicitado não está mais disponível no servidor e nenhum endereço de encaminhamento é conhecido.

# STATUS_CODE_411
source: The server refuses to accept the requests without a defined Content- Length.
pt_br: O servidor se recusa a aceitar as solicitações sem um comprimento de conteúdo definido.

# STATUS_CODE_413
source: The server is refusing to process a request because the request entity is larger than the server is willing or able to process
pt_br: O servidor se recusa a processar uma solicitação porque a entidade de solicitação é maior do que o servidor deseja ou é capaz de processar

# STATUS_CODE_414
source: The server is refusing to service the request because the Request-URI is longer than the server is willing to interpret.
pt_br: O servidor está se recusando a atender à solicitação porque o URI de solicitação é mais longo do que o servidor está disposto a interpretar.

# STATUS_CODE_415
source: The server is refusing to service the request because the entity of the request is in a format not supported by the requested resource for the requested method.
pt_br: O servidor se recusa a atender à solicitação porque a entidade da solicitação está em um formato não compatível com o recurso solicitado para o método solicitado.

# STATUS_CODE_418
source: I'm a teapot.
pt_br: Eu sou um bule de chá

# STATUS_CODE_500
source: The server encountered an unexpected condition which prevented it from fulfilling the request.
pt_br: O servidor encontrou uma condição inesperada que o impediu de atender à solicitação.

# STATUS_CODE_501
source: The server does not support the functionality required to fulfill the request.
pt_br: O servidor não oferece suporte à funcionalidade necessária para atender à solicitação.

# STATUS_CODE_502
source: The server, while acting as a gateway or proxy, received an invalid response from the upstream server it accessed in attempting to fulfill the request.
pt_br: O servidor, enquanto agia como um gateway ou proxy, recebeu uma resposta inválida do servidor upstream que ele acessou na tentativa de atender à solicitação.

# STATUS_CODE_503
source: The server is currently unable to handle the request due to a temporary overloading or maintenance of the server.
pt_br: O servidor atualmente não consegue lidar com a solicitação devido a uma sobrecarga temporária ou manutenção do servidor.

# STATUS_CODE_504
source: The server, while acting as a gateway or proxy, did not receive a timely response from the upstream server.
pt_br: O servidor, ao atuar como gateway ou proxy, não recebeu uma resposta oportuna do servidor upstream.

# STATUS_CODE_505
source: The server does not support, or refuses to support, the HTTP protocol version that was used in the request message.
pt_br: O servidor não oferece suporte ou se recusa a aceitar a versão do protocolo HTTP usada na mensagem de solicitação.

# STATUS_CODE_510
source: The policy for accessing the resource has not been met in the request.
pt_br: A política de acesso ao recurso não foi atendida na solicitação.

# STATUS_CODE_511
source: Network authentication is required before proceeding.
pt_br: A autenticação de rede é necessária antes de prosseguir.

# STATUS_CODE_UNKNOW
source: Unknow response $[VALUE].
pt_br: Resposta desconhecida: $[VALUE].
